In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [2]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.date_range(start='2024-10-01', periods=n_rows, freq='h')

df = df.reset_index()
df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2024-10-01 00:00:00         13.0         12    A
1 2024-10-01 01:00:00          1.0          8    B
2 2024-10-01 02:00:00         14.0         16    C
3 2024-10-01 03:00:00         16.0         18    D
4 2024-10-01 04:00:00          3.0          6    E

In [3]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [4]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         13.0         12
1          1.0          8
2         14.0         16
3         16.0         18
4          3.0          6

In [5]:
df.select_dtypes(include='float')

   bil_pecahan
0         13.0
1          1.0
2         14.0
3         16.0
4          3.0

In [6]:
df.select_dtypes(include='int')

   bil_bulat
0         12
1          8
2         16
3         18
4          6

In [7]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [8]:

df.select_dtypes(include='datetime')

                index
0 2024-10-01 00:00:00
1 2024-10-01 01:00:00
2 2024-10-01 02:00:00
3 2024-10-01 03:00:00
4 2024-10-01 04:00:00

In [9]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0         13.0         12    A
1          1.0          8    B
2         14.0         16    C
3         16.0         18    D
4          3.0          6    E